<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [104]:
import pandas as pd
import psycopg2

In [105]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [106]:
connection = psycopg2.connect(
    dbname='project_sql',
    user='skillfactory',
    host='84.201.134.129',
    password='cCkxxLVrDE8EbvjueeMedPKt',
    port=5432
)


#DBNAME = 'project_sql'
#USER = 'skillfactory'
#PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
#HOST = '84.201.134.129'
#PORT = 5432

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [107]:
# текст запроса
query = f'''select
                     count(id) /*подсчитываем количество вакансий по уникальным id из таблицы vacancies*/
                from 
                     vacancies;
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_24384\3505305123.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  49197

In [108]:
# результат запроса
49197

49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [109]:
# текст запроса
query = f'''select
                     count(id) /*подсчитываем количество работодателей по уникальным id из таблицы employers*/
                from 
                     employers;
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_24384\1449259975.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  23501

In [110]:
# результат запроса
23501

23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [111]:
# текст запроса
query = f'''select
                     count(id) /*подсчитываем количество регионов по уникальным id из таблицы areas*/
                from 
                     areas;
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_24384\320346689.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1362

In [112]:
# результат запроса
1362

1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [113]:
# текст запроса
query = f'''select
                     count(id) /*подсчитываем количество сфер деятельности по уникальным id из таблицы industries*/
                from 
                     industries;
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_24384\3149461227.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    294

In [114]:
# результат запроса
294

294

***

In [115]:
# выводы по предварительному анализу данных
База данных содержит следующую информацию:
     - имеются данные о 49 197 вакансиях;
     - количество работодателей составляет 23 501;
     - работодатели расположены в 1 362 регионах;
     - в таблице представлены данные о 294 сферах деятельности.

SyntaxError: invalid syntax (3994396071.py, line 2)

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [ ]:
# текст запроса
query = f'''select                     
                     COUNT (v.id) AS cnt,
                     a.name AS area /*подсчитываем количество вакансий в соответствующих названиях регионов*/
                from 
                     vacancies AS v JOIN areas AS a ON v.area_id = a.id /*добавляем к перечню вакансий соответствующее наименование региона по id*/
                group by a.name
                order by cnt DESC
             '''
df = pd.read_sql_query(query, connection)
df

In [ ]:
# результат запроса
	cnt	area
0	5333	Москва
1	2851	Санкт-Петербург
2	2112	Минск
3	2006	Новосибирск
4	1892	Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [ ]:
# текст запроса
query = f'''select                     
                     COUNT(id) /*подсчитываем кол-во id вакансий*/
                     
                from 
                     vacancies
                where salary_from IS NOT NULL OR salary_to IS NOT NULL /*условие отбора - указано значение минимальной ИЛИ максимальной ЗП*/
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\130581162.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  24073

In [ ]:
# результат запроса
24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [ ]:
# текст запроса
query = f'''select                     
                     ROUND(AVG(salary_from)) AS min_salary, /*округляем среднее значение минимальной ЗП*/
                     ROUND(AVG(salary_to)) AS max_salary    /*округляем среднее значение максимальной ЗП*/
                     
                from 
                     vacancies
                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\2215013579.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   min_salary  max_salary
0     71065.0    110537.0

In [ ]:
# результат запроса
	min_salary	max_salary
0	71065.0 	110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [ ]:
# текст запроса
query = f'''select                     
                     schedule,
                     employment,
                     COUNT(*) AS vacancy_count /*считаем количество вакансий по вариантам сочетаний рабочего графика и типа занятости*/
               
                from 
                     vacancies 
                group by schedule, employment
                order by vacancy_count desc                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\1594388148.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            schedule           employment  vacancy_count
0        Полный день     Полная занятость          35367
1   Удаленная работа     Полная занятость           7802
2      Гибкий график     Полная занятость           1593
3   Удаленная работа  Частичная занятость           1312
4     Сменный график     Полная занятость            940
5        Полный день           Стажировка            569
6     Вахтовый метод     Полная занятость            367
7        Полный день  Частичная занятость            347
8      Гибкий график  Частичная занятость            312
9        Полный день     Проектная работа            141
10  Удаленная работа     Проектная работа            133
11     Гибкий график           Стажировка            116
12    Сменный график  Частичная занятость            101
13  Удаленная работа           Стажировка             64
14     Гибкий график     Проектная работа             18
15    Сменный график           Стажировка             12
16    Вахтовый метод     Проектная работа              2
17    Сменный график     Проектная работа              1

In [ ]:
# результат запроса
1	Удаленная работа	Полная занятость	7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [ ]:
# текст запроса
query = f'''select                     
                     experience,
                     COUNT(*) /*подсчитываем количество вакансий по критерию требуемого опыта*/
                    
                     
                from 
                     vacancies
                
                GROUP BY experience
                HAVING experience IS NOT NULL /*исключаем вакансии, в которых не указан требуемый опыт работы*/
                ORDER BY count ASC
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\245015627.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

In [ ]:
# результат запроса
	experience	count
0	Более 6 лет	1337
1	Нет опыта	7197
2	От 3 до 6 лет	14511
3	От 1 года до 3 лет	26152

***

In [ ]:
# выводы по детальному анализу вакансий
Наибольшее количество вакансий приходится на Москву - 5 333.
В 24 073 вакансиях указано хотя бы одно значение желаемого уровня заработной платы.
Среднее значение желаемой ЗП находится в пределах от 71 065 до 110537.
Наиболее популярным сочетанием рабочего графика и типа трудоустройства является сочетание "Полный день - Полная занятость" - 35 367 вакансий.
Наибольшее количество вакансий (26 152) предъявляют требования к опыту соискателей от 1 до 3х лет.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [ ]:
# текст запроса
query = f'''select                     
                     
                     e.name, /*выводим наименование работодятеля из таблицы employers и кол-во вакансий из таблицы vacancies*/
                     count(v.id)
                    
                from 
                     vacancies v join employers e ON e.id = v.employer_id /*соединяем таблицы вакансий и работодателей по id*/
                group by e.name
                order by count(v.id) desc
                limit 5
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\2437063445.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

In [ ]:
# результат запроса
	name	count
0	Яндекс	1933
1	Ростелеком	491
2	Тинькофф	444
3	СБЕР	428
4	Газпром нефть	331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [ ]:
# текст запроса
query = f'''select                     
                     
                     a.name area, /*для каждого наименования региона подсчитываем кол-во работодателей и вакансий*/
                     count (e.id) employers,
                     count (v.id) vacancies
                    
                from areas a /*добавляем к таблице регионов нанимателей и вакансии по id*/
                    left join employers e ON a.id = e.area
                    left join vacancies v ON v.area_id = a.id
                where v.id is null /*условие для отбора регионов, в которых нет вакансий*/
                group by a.name
                Order by count (e.id) DESC
                
                
             '''
df = pd.read_sql_query(query, connection)
df

In [ ]:
# результат запроса
	area	employers	vacancies
0	Россия	410	0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [ ]:
# текст запроса
query = f'''select                     
                     
                     e.name AS employer, /*выводим наименование работодателя и кол-во уникальных регионов, где размещены его вакансии*/
                     count (DISTINCT v.area_id) cnt_areas
                     
                    
                from employers e
                    join vacancies v ON e.id = v.employer_id /*соединяем таблицы работодателей и вакансий по id*/
                    
                group by e.name
                Order by count (v.area_id) DESC
                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\266892309.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                                    employer  cnt_areas
0                                     Яндекс        181
1                                 Ростелеком        152
2                                   Тинькофф         43
3                                       СБЕР         24
4                              Газпром нефть         24
...                                      ...        ...
14761             ПСБ Инновации и Инвестиции          1
14762                             ПСЗ Янтарь          1
14763                                    ПСК          1
14764  Псковский завод механических приводов          1
14765                     ПСК ТатЭнергоСтрой          1

[14766 rows x 2 columns]

In [ ]:
# результат запроса
employer	cnt_areas
0	Яндекс	181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [ ]:
# текст запроса
query = f'''select                     
                     
                COUNT(e.name)
 
                from employers AS e /*присоединяем к таблице работодателей значения сфер деятельности*/
                LEFT JOIN employers_industries AS ei ON e.id = ei.employer_id
                where industry_id is NULL /*критерий отбора - работодатели у которых сфера деятельности отсутствует*/
                    
                
                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\2679280710.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   8419

In [ ]:
# результат запроса
8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [ ]:
# текст запроса
query = f'''select                     
                e.name,     
                ei.employer_id,
                COUNT (ei.industry_id) /*подсчет количества сфер деятельности*/
                
                from employers_industries AS ei LEFT JOIN employers AS e ON ei.employer_id = e.id /*присоединяем название работодателя к перечню сфер деятельности по id*/
                
                GROUP BY ei.employer_id, e.name
                HAVING COUNT (ei.industry_id) = 4 /*отбор по количеству сфер деятельности равному четырем*/
                ORDER BY e.name
                LiMIT 1 /*выводим третье значение - одна строка с пропуском двух первых результатов*/
                OFFSET 2    
                
                
                
             '''
df = pd.read_sql_query(query, connection)
df

In [ ]:
# результат запроса
2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [ ]:
# текст запроса
query = f'''select   
                i.name,                  
                COUNT(ei.employer_id) 
                                                
                from employers_industries AS ei LEFT JOIN industries AS i ON ei.industry_id = i.id /*присоединяем к перечню сфер деятельности наименования по id*/
                WHERE i.name = 'Разработка программного обеспечения' /*критерий отбора по признаку "Разработка ПО"*/
                GROUP BY i.name
                   
                
                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\2697653425.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                                  name  count
0  Разработка программного обеспечения   3553

In [ ]:
# результат запроса
3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [ ]:
# код для получения списка городов-милионников
import requests 
from bs4 import BeautifulSoup 

url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России' 
response = requests.get(url)
# дальше работа с содержимым страницы
page = BeautifulSoup(response.text, 'html.parser') # Создаём объект BeautifulSoup, указывая html-парсер
data = []
HTML_data = page.find_all("table")[0].find_all("tr")[1:]
for element in HTML_data:
    sub_data = []
    for i,k in enumerate(element):
        try:
            if i == 1:
                sub_data.append(k.get_text())
        except:
            continue
    data.append(sub_data)
data_result = []
for elem in data:
    data_result.extend(elem)
data_result = tuple(data_result)
data_result

In [ ]:
# текст запроса
query = f'''WITH temp AS (select   
                a.name,                  
                COUNT(v.id) AS cnt
                                                
               from vacancies v
               left join employers e on v.employer_id = e.id /*добавляем к перечню вакансий работодателей и регионы по id*/
               left join areas a on a.id = v.area_id
               where e.name = 'Яндекс' AND a.name in {data_result} /*отбор по работодателю "Яндекс" и регионы из запроса по городам-миллионникам*/
               GROUP BY a.name
               ORDER BY COUNT(v.id))
                
               SELECT * FROM temp /*суммируем общее число вакансий из предыдущего запроса*/
               UNION ALL
               SELECT 'Total', SUM(cnt) FROM temp

                
                   
                
                
                
             '''
df = pd.read_sql_query(query, connection)
df

In [ ]:
# результат запроса

	name	cnt
0	Омск	21.0
1	Челябинск	22.0
2	Красноярск	23.0
3	Волгоград	24.0
4	Пермь	25.0
5	Казань	25.0
6	Ростов-на-Дону	25.0
7	Уфа	26.0
8	Самара	26.0
9	Краснодар	30.0
10	Воронеж	32.0
11	Новосибирск	35.0
12	Нижний Новгород	36.0
13	Екатеринбург	39.0
14	Санкт-Петербург	42.0
15	Москва	54.0
16	Total	485.0

***

In [ ]:
# выводы по анализу работодателей
Компания "Яндекс" находится на первом месте по количеству вакансий (1 933).
Наибольшее число работодателей (410), расположенных в регионе в котором нет вакансий находится в регионе "Россия".
Раблтодателем с наибольшим количеством регионов в которых размещены вакансии является компания "Яндекс" - представлена в 181 регионе.
8 419 работодателей не указывают свою сферу деятельности при размещении вакансий.
1 138 компаний относят себя к 4м сферам деятельности.
Разработка программного обеспечения указана в качестве сферы деятельности у	3 553 компаний.
Компания "Яндекс" разместила 485 вакансий в городах с населением более 1 млн. человек.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [ ]:
# текст запроса
query = f'''select   
                COUNT(name)                  
                
                from vacancies
                WHERE lower(name) LIKE '%data%' OR lower(name) LIKE '%данн%' /*приводим запрос к нижнему регистру*/
                
                   
                
                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\2524773376.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1771

In [ ]:
# результат запроса
1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [ ]:
# текст запроса

query = f'''select   
                COUNT(id)                  
                
                from vacancies
                where (name ILIKE '%data scientist%' OR  /*формируем набор фильтров по содержанию в имени, при запросе через ILIKE игнорируем регистр*/
                      name ILIKE '%data science%' OR  
                      name ILIKE '%исследователь данных%' OR
                      (name ILIKE '%ML%' AND name NOT ILIKE '%HTML%') OR
                      name ILIKE '%machine learning%' OR
                      name ILIKE '%машинн%обучен%')
                      
                      AND (name ILIKE '%junior%' OR  /*формируем набор фильтров по отборам на "новичка", игнорируем регистр*/
                          experience = 'Нет опыта' OR
                          employment = 'Стажировка')
                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\4008219531.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0     51

In [ ]:
# результат запроса
51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [ ]:
# текст запроса

query = f'''select   
                COUNT(id)                  
                --*
                from vacancies
                where (name ILIKE '%data scientist%' OR  /*формируем набор фильтров по содержанию в имени, при запросе через ILIKE игнорируем регистр*/
                      name ILIKE '%data science%' OR  
                      name ILIKE '%исследователь данных%' OR
                      (name ILIKE '%ML%' AND name NOT ILIKE '%HTML%') OR
                      name ILIKE '%machine learning%' OR
                      name ILIKE '%машинн%обучен%' )
                      
                      
                      AND (key_skills IS NOT NULL AND key_skills ILIKE '%SQL%' OR key_skills ILIKE '%postgres%') /*отбираем навыки по 'SQL' или postgres*/
                                            

                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\554454291.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    229

In [ ]:
# результат запроса
229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [ ]:
# текст запроса

query = f'''select   
                COUNT(id)                  
                
                from vacancies
                where (name ILIKE '%data scientist%' OR  /*формируем набор фильтров по содержанию в имени, при запросе через ILIKE игнорируем регистр*/
                      name ILIKE '%data science%' OR  
                      name ILIKE '%исследователь данных%' OR
                      (name ILIKE '%ML%' AND name NOT ILIKE '%HTML%') OR
                      name ILIKE '%machine learning%' OR
                      name ILIKE '%машинн%обучен%' )
                      
                      
                      AND (key_skills IS NOT NULL AND key_skills ILIKE '%python%') /*отбираем навыки по ключу 'python'*/
                                            

                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_24384\3107641972.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    357

In [ ]:
# результат запроса
357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [ ]:
# текст запроса
query = f'''select   

                round(avg(length(key_skills)-length(replace(key_skills, CHR(9), ''))+1), 2) /*кол-во навыков = разность кол-во символов - кол-во символов с заменой '/' на пустые + 1*/
                
                from vacancies
                where key_skills IS NOT NULL AND
                      name ILIKE '%data scientist%' OR  /*формируем набор фильтров по содержанию в имени, при запросе через ILIKE игнорируем регистр*/
                      name ILIKE '%data science%' OR  
                      name ILIKE '%исследователь данных%' OR
                      (name LIKE '%ML%' AND name NOT ILIKE '%HTML%') OR
                      name ILIKE '%machine learning%' OR
                      name ILIKE '%машинн%обучен%' 
                      
                      
                      
                                            

                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_24384\3467308496.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   round
0   6.41

In [ ]:
# результат запроса
6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [ ]:
# текст запроса
query = f'''select   
                
                experience,
                ROUND(AVG(coalesce((salary_from + salary_to)/2, salary_from, salary_to)), 0)  /*вычисляем среднее между двумя ЗП если они не NULL, в ином случае берем первое непустое значение*/                
                
                from vacancies
                where (salary_from is not NULL or salary_to is not null) /*одно из значений заработной платы не равно нулю*/
                      AND
                      (name ILIKE '%data scientist%' OR  /*формируем набор фильтров по содержанию в имени, при запросе через ILIKE игнорируем регистр*/
                      name ILIKE '%data science%' OR  
                      name ILIKE '%исследователь данных%' OR
                      (name LIKE '%ML%' AND name NOT ILIKE '%HTML%') OR
                      name ILIKE '%machine learning%' OR
                      name ILIKE '%машинн%обучен%') 
                 GROUP BY experience  
                 ORDER BY 1 DESC
                    
                      
                      
                                            

                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_33600\3633262300.py:26: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience     round
0       От 3 до 6 лет  243115.0
1  От 1 года до 3 лет  139675.0
2           Нет опыта   74643.0

In [ ]:
# результат запроса
243115.0

***

In [ ]:
# выводы по предметному анализу
В целом, по ключевым словам, содержащим 'data' или 'данн' можно найти 1 771 вакансию.
При этом для начиняющих дата-сайентистов найдется всего 51 вакансия (2.9%).
Ключевые навыки SQL или postgres требуются для 229 вакансий, требования к знанию Python предъявляют 357 вакансий.
В среднем в вакансиях для DS указываются требования к 6.41 навыкам.
Диапазон среднего уровня заработной платы в сфере DS составляет от 74.6 тыс. руб. для кандидата без опыта работы до 243.1 тыс. руб. для специалиста с опытом от 3х до 6 лет.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
На основании имеющейся базы данных можно сделать следующие выводы:
В базе содержится информация о 49.2 тысячах вакансий от 23.5 тыс. работодателей в 1 362 регионах и 294 сферах деятельности.
Уровень зарплат в целом по вакансиям изменяется в размере от 71 до 110.5 тыс. руб.
Полная занятость в формате удаленной работы предлагается в 7 802 случаях (15,86% от общего числа вакансий)
Наибольшее количество вакансий (26 152) предъявляют требования к опыту соискателей от 1 до 3х лет.

Сфера DS представлена в базе 480 вакансиями (0,98% от общего числа вакансий). При этом на города федерального значения приходится 58,5% от размещенных вакансий.

146805.0	216356.0
Следует отметить, что средние уровни ЗП (там, где они указаны) в сфере DS значительно выше чем в среднем по базе вакансий - минимальный средний уровень состаляет 146.8 тыс. руб. (2.06 раза);
максимальный уровень ЗП в DS (216.36 тыс. руб.) выше среднего по выборке вакансий в целом в 1.96 раза.

# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

In [120]:
# Сколько всего вакансий подходящих под критерии отбора DS содержится в базе данных:

query = f'''select   
                *
                --COUNT(id)                  
                
                from vacancies
                where (name ILIKE '%data scientist%' OR  /*формируем набор фильтров по содержанию в имени, при запросе через ILIKE игнорируем регистр*/
                      name ILIKE '%data science%' OR  
                      name ILIKE '%исследователь данных%' OR
                      (name LIKE '%ML%' AND name NOT ILIKE '%HTML%') OR
                      name ILIKE '%machine learning%' OR
                      name ILIKE '%машинн%обучен%' )
                 ORDER BY salary_from DESC     
                      
                      
                                            

                
                
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_24384\4283948029.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55311099,ML Engineer Team Lead (to Cyprus),Python\tLinux\tKubernetes\tAWS\tGit\tPeople Ma...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,236,3266823
1,54824572,Data Scientist,Oracle Pl/SQL\tБазы данных\tMachine Learning\t...,Полный день,От 1 года до 3 лет,Полная занятость,NaN,NaN,160,111304
2,54654842,Data Scientist / Аналитик Data Science,Python\tData Mining\tАнглийский язык\tИскусств...,Полный день,От 1 года до 3 лет,Полная занятость,NaN,NaN,1,14896
3,54851586,Data scientist (графы),Python\tSpark\tMachine Learning\tPyTorch\tTens...,Полный день,От 1 года до 3 лет,Полная занятость,NaN,NaN,1,3388
4,54720540,Senior ML Developer (обучение моделей виртуаль...,None,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,1,3776
...,...,...,...,...,...,...,...,...,...,...
475,54825318,Data Scientist (Junior+),Python\tOpenCV\tTensorflow\tComputer Vision\tН...,Полный день,От 1 года до 3 лет,Полная занятость,50000.0,70000.0,72,215942
476,55145641,Junior Data Scientist,Python\tSQL\tMachine Learning\tData Science\tА...,Полный день,Нет опыта,Полная занятость,50000.0,NaN,2,40938
477,55052496,Junior Data Scientist,Python\tSQL\tАнглийский язык\tLinux\tООП,Полный день,От 1 года до 3 лет,Полная занятость,50000.0,NaN,76,2029927
478,55166994,ML разработчик (удалённо),Python\tПоиск информации в интернет\tC++\tМате...,Удаленная работа,От 1 года до 3 лет,Полная занятость,50000.0,100000.0,1,6154479
479,54475492,Data Scientist (Junior),Python\tMachine Learning\tPandas\tSQL\tNumpy\t...,Полный день,Нет опыта,Частичная занятость,45000.0,100000.0,1,665449

In [131]:
# Каким образом вакансии, подходящие под критерии отбора DS распределены по регионам:

query = f'''WITH temp AS (select   
                a.name AS location,
                COUNT(v.id) AS vacancy_cnt                  
                
                from vacancies v LEFT join areas a ON v.area_id = a.id
                where (v.name ILIKE '%data scientist%' OR  /*формируем набор фильтров по содержанию в имени, при запросе через ILIKE игнорируем регистр*/
                      v.name ILIKE '%data science%' OR  
                      v.name ILIKE '%исследователь данных%' OR
                      (v.name LIKE '%ML%' AND v.name NOT ILIKE '%HTML%') OR /*LIKE '%ML%' - отбираем только сочетание ML с учетом регистра*/
                      v.name ILIKE '%machine learning%' OR
                      v.name ILIKE '%машинн%обучен%' )
                
                GROUP BY a.name 
                ORDER BY 2 DESC)  
                
                
             SELECT * FROM temp /*суммируем общее число вакансий из предыдущего запроса*/
             UNION ALL
             SELECT 'Total', SUM(vacancy_cnt) FROM temp
             '''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_24384\1207301380.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                     location  vacancy_cnt
0                      Москва        217.0
1             Санкт-Петербург         64.0
2                 Новосибирск         23.0
3             Нижний Новгород         20.0
4                      Казань         16.0
5                      Алматы         16.0
6                       Минск          9.0
7                       Томск          8.0
8                Екатеринбург          7.0
9                   Краснодар          6.0
10             Ростов-на-Дону          6.0
11                    Армения          6.0
12                 Нур-Султан          6.0
13                     Самара          5.0
14                      Пермь          5.0
15                       Кипр          5.0
16                     Рязань          4.0
17                    Ташкент          4.0
18                  Иннополис          3.0
19                    Тбилиси          3.0
20                Владивосток          3.0
21                     Сербия          3.0
22                       Омск          3.0
23                        Уфа          2.0
24                    Израиль          2.0
25                     Турция          2.0
26                      Пенза          2.0
27  Киров (Кировская область)          2.0
28                      Чехия          2.0
29                       Баку          2.0
30                      Литва          2.0
31                    Воронеж          2.0
32           Набережные Челны          1.0
33                    Барнаул          1.0
34                     Батуми          1.0
35                   Белгород          1.0
36                     Бишкек          1.0
37                     Брянск          1.0
38                  Волгоград          1.0
39                 Зеленоград          1.0
40                     Ижевск          1.0
41                    Королев          1.0
42                 Красноярск          1.0
43                    Абхазия          1.0
44                       Орел          1.0
45               Петрозаводск          1.0
46                     Польша          1.0
47                    Саратов          1.0
48                      Тверь          1.0
49                     Тюмень          1.0
50                  Челябинск          1.0
51                 Черногория          1.0
52                      Total        480.0

In [130]:
# Средний уровень минимальной/максимальной ЗП в сфере DS:

query = f'''select                     
                     ROUND(AVG(salary_from)) AS min_salary, /*округляем среднее значение минимальной ЗП*/
                     ROUND(AVG(salary_to)) AS max_salary    /*округляем среднее значение максимальной ЗП*/
                     
                 from vacancies
                where (salary_from is not NULL or salary_to is not null) /*одно из значений заработной платы не равно нулю*/
                      AND
                      (name ILIKE '%data scientist%' OR  /*формируем набор фильтров по содержанию в имени, при запросе через ILIKE игнорируем регистр*/
                      name ILIKE '%data science%' OR  
                      name ILIKE '%исследователь данных%' OR
                      (name LIKE '%ML%' AND name NOT ILIKE '%HTML%') OR
                      name ILIKE '%machine learning%' OR
                      name ILIKE '%машинн%обучен%') 
                   
                 ORDER BY 1 DESC'''
df = pd.read_sql_query(query, connection)
df

C:\Users\Kaelis\AppData\Local\Temp\ipykernel_24384\2332549293.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   min_salary  max_salary
0    146805.0    216356.0